components/py_engine/micropython-lib/micropython/xmltok/test.xml

<?xml version="1.0"?>
<s:Envelope
  xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
  s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<s:Body>
<u:GetConnectionTypeInfo
  xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1">
  foo bar
  baz
  
</u:GetConnectionTypeInfo>
<!-- Comments, you won't see me after tokenize. -->
</s:Body>
</s:Envelope>
